local _, ns = ...;

ns._db.CommonFrameLines = {
    [827999436] = "Натисніть, щоб увімкнути/вимкнути підказки для цього вікна."
}

ns._db.SpellbookFrameLines = {
    [3434792140] = "Книга заклинань",
    [2530527920] = "Професії",
    [2643829451] = "Вихованець",
    -- Help
    [1445048669] = "Перетягніть заклинання на панель дії.  Спочатку відображаються ваші активні заклинання, а потім пасивні.",
    [4256164532] = "На цих вкладках відображаються ваші поточні заклинання.",
    [2326438735] = [[На цих вкладках ви можете побачити всі заклинання, які ви отримаєте, якщо зміните свою спеціалізацію.

Деякі з них будуть доступні у декількох спеціалізаціях.]],
}
