local _, ns = ...;

-- Constants
ns.LEVEL_TRANSLATION = "Рівень"
ns.RANK_TRANSLATION = "Ранг"
ns.PAGE_TRANSLATION = "Сторінка"
ns.LEADER_TRANSLATION = "Ватажок"

ns.SPELL_GENERAL_TRANSLATION = "Загальні"
ns.SPELL_PASSIVE_TRANSLATION = "Пасивний"
ns.SPELL_RANK_TRANSLATION = "Pівень"
ns.SPELL_NEXT_RANK_TRANSLATION = "Наступний рівень:"

ns.TALENT_REPLACES_TRANSLATION = "Замінює"
ns.TALENT_UPGRADE_TRANSLATION = "Оновлення"

ns.PET_LEVEL_TRANSLATION = "Супутник {1} рівня"
ns.PET_CAPTURABLE_TRANSLATION = "Mожна приручити"
ns.PET_COLLECTED_TRANSLATION = "Зібрано ({1}/{2})"

ns._db = {}

ns._db.Classes = {
    [4012678111] = { "Лицар Смерті", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [2216469706] = { "Мисливець на демонів", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [939162334] = { "Друїд", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [3341537749] = { "Пробудник", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [275318536] = { "Мисливець", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [1522928645] = { "Маг", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [1700626310] = { "Монах", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [3818508882] = { "Паладин", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [4154208400] = { "Жрець", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [932949058] = { "Пройдисвіт", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [3146146336] = { "Шаман", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [2480148675] = { "Чорнокнижник", "", "", "", "", "", "", "", "", "", "", "", "", "" },
    [327001090] = { "Воїн", "", "", "", "", "", "", "", "", "", "", "", "", "" },
}

ns._db.Specializations = {
    [895361522] = "Кров",
    [915181301] = "Лід",
    [1190157142] = "Нечестивість",
    [3341913344] = "Хаос",
    [1887615620] = "Помста",
    [2701967763] = "Баланс",
    [3151776828] = "Дикий",
    [3970690525] = "Вартовий",
    [3148372663] = "Відновлення",
    [3493433688] = "Спустошення",
    [3213003289] = "Збереження",
    [347730504] = "Володар звірів",
    [3119425519] = "Стрільба",
    [3489469389] = "Виживання",
    [4054138436] = "Таємна магія",
    [2879078572] = "Вогонь",
    [2527356898] = "Пивовар",
    [759332951] = "Ткач туману",
    [1666394764] = "Вітрохід",
    [526463373] = "Святість",
    [3294148104] = "Розплата",
    [622486369] = "Захист",
    [4207033350] = "Дисципліна",
    [3147761239] = "Тінь",
    [401272522] = "Вбивця",
    [4286937362] = "Бандит",
    [3401435916] = "Розвідник",
    [530495695] = "Стихії",
    [1495285058] = "Вдосконалення",
    [3157151487] = "Прокляття",
    [911587049] = "Демонологія",
    [1666313859] = "Руйнування",
    [674331138] = "Зброя",
    [2784688775] = "Лють",
}

ns._db.UnitTypes = {
    [1533463572] = "Звір",
    [3622049986] = "Драконід",
    [3191838751] = "Демон",
    [2771787563] = "Елементаль",
    [1527380299] = "Гігант",
    [1604911792] = "Нежить",
    [2830990351] = "Гуманоїд",
    [2755661964] = "Створіння",
    [80875114] = "Механізм",
    [507603013] = "Тотем",
    [1085814411] = "Небойовий Супутник",
    [1402454280] = "Газова Хмара",
    [2027583260] = "Дикий Супутник",
    [2540928608] = "Аберація",
    [766262262] = "Труп",
    [2093328826] = "Водний",
}

ns._db.UnitRanks = {
    [403204035] = "Елітний",
    [4252393971] = "Рідкісний",
    [2313915581] = "Рідкісний Елітний",
    [865654154] = "Бос",
}

ns._db.CommonSpellAttributes = {
    -- Spell range
    [1058728356] = "T: Unlimited range",
    [4074264436] = "Ближній бій",
    [3782563343] = "Дистанція: {1} м",
    [1817768102] = "Дистанція: {1}-{2} м",
    -- Spell cooldown
    [774638190] = "T: Recharging: {1} sec",
    [2834160027] = "T: Recharging: {1} min",
    [132771445] = "Відновлення: {1} сек",
    [3950124302] = "Відновлення: {1} хв",
    [1926006671] = "Відновлення: {1} год",
    -- Spell cast time
    [2205574258] = "Миттєво",
    [4208014116] = "Підтримується",
    [4176069676] = "{1} сек. застосування",
    -- TODO:
    [728783484] = "T: {1} sec empower", -- (Evoker)
    -- Spell Resource
    [123472231] = "{1} зарядів магії",
    [2883780072] = "{1} астральної сили",
    [1422759959] = "{1} Чі",
    [2080889112] = "{1}-{2} оч. серії",
    [1393788758] = "{1} енергії",
    [1797199989] = "{1} есенції",
    [4012109640] = "{1} концентрації",
    [4124423596] = "{1} люті",
    [32922540] = "{1} святої сили",
    [1598205381] = "{1} безумства",
    [3610556042] = "{1} виру стихій",
    [3537488612] = "{1} мани",
    [2381226351] = "{1} болю",
    [1484843775] = "{1} гніву",
    [3563568846] = "{1}-{2} гніву",
    [2901593347] = "{1} рун",
    [3459960635] = "{1} рунa",
    [335373991] = "{1} сили рун",
    [861701157] = "{1} сили рун за сек",
    [1419705412] = "{1} уламків душ",
    [1978072700] = "T: {1} Soul Shard",
    [3689279656] = "T: {1} Mana per sec",   -- (warlock Drain Soul)
    [2430624037] = "T: {1} Energy, plus {2} per sec",
    [3179380790] = "T: {1} Energy per sec", -- (monk)
    -- Spell Commons
    [2608272577] = "Максимум {1} зарядів",
    -- Evoker Spell colors
    [2614467213] = "Червоний",
    [1298549553] = "Синій",
    [1320281273] = "Зелений",
    [2381883528] = "Бронзовий",
    [2458751427] = "Чорний",
}
