local _, ns = ...;

-- Constants
ns.LEVEL_TRANSLATION = "Рівень"
ns.PAGE_TRANSLATION = "Сторінка"
ns.LEADER_TRANSLATION = "Правитель"

ns.SPELL_PASSIVE_TRANSLATION = "Пасивний"
ns.SPELL_RANK_TRANSLATION = "Pівень"
ns.SPELL_NEXT_RANK_TRANSLATION = "Наступний рівень:"

ns._db = {}

ns._db.UnitTypes = {
    [1263733816] = "Звір",
    [1380758106] = "Драконід",
    [2922108995] = "Демон",
    [530495695] = "Елементаль",
    [1257650543] = "Гігант",
    [1335182036] = "Нежить",
    [589698483] = "Гуманоїд",
    [514370084] = "Створіння",
    [1163581639] = "Механізм",
    [237873257] = "Тотем",
    [4168209797] = "Небойовий Улюбленець",
    [2103008983] = "Газова Хмара",
    [2721766664] = "Дика Тварина",
    [3623635121] = "Аберація",
    [496532506] = "Труп",
}

ns._db.UnitRanks = {
    [133474279] = "Елітний",
    [3982664215] = "Рідкісний",
    [2482834624] = "Рідкісний Елітний",
    [595924386] = "Бос",
}

ns._db.CommonSpellAttributes = {
    -- Spell range
    [4074264436] = "Ближній бій",
    [3782563343] = "Відстань {1} м",
    [1817768102] = "Відстань {1}-{2} м",
    -- Spell cooldown
    [132771445] = "Відкат: {1} сек.",
    [3950124302] = "Відкат: {1} хв.",
    [1926006671] = "Відкат: {1} год.",
    -- Spell cast time
    -- TODO: Channeled
    [2205574258] = "Миттєво",
    [4176069676] = "Вимовлення: {1} сек.",
    -- Spell Resource
    [123472231] = "{1} од. Таємних Зарядів",
    [2883780072] = "{1} од. Астральної Сили",
    [1422759959] = "{1} од. Чі",
    [2080889112] = "{1}-{2} Балів Комбо",
    [1393788758] = "{1} од. Енергії",
    [1797199989] = "{1} од. Сутності",
    [4012109640] = "{1} од. Концентрації",
    [4124423596] = "{1} од. Люті",
    [32922540] = "{1} од. Святої Сили",
    [1598205381] = "{1} од. Безумства",
    [3610556042] = "{1} од. Виру",
    [3537488612] = "{1} од. Мани",
    [2381226351] = "{1} од. Болі",
    [1484843775] = "{1} од. Гніву",
    [2901593347] = "{1} од. Рун",
    [335373991] = "{1} од. Сили Рун",
    [1419705412] = "{1} од. Уламків душ",
}
