local _, ns = ...;

-- Constants
ns.LEVEL_TRANSLATION = "Рівень"
ns.PAGE_TRANSLATION = "Сторінка"
ns.LEADER_TRANSLATION = "Правитель"

ns.SPELL_PASSIVE_TRANSLATION = "Пасивний"
ns.SPELL_RANK_TRANSLATION = "Pівень"
ns.SPELL_NEXT_RANK_TRANSLATION = "Наступний рівень:"

ns._db = {}

ns._db.UnitTypes = {
    [1263733816] = "Звір",
    [1380758106] = "Драконід",
    [2922108995] = "Демон",
    [530495695] = "Елементаль",
    [1257650543] = "Гігант",
    [1335182036] = "Нежить",
    [589698483] = "Гуманоїд",
    [514370084] = "Створіння",
    [1163581639] = "Механізм",
    [237873257] = "Тотем",
    [4168209797] = "Небойовий Улюбленець",
    [2103008983] = "Газова Хмара",
    [2721766664] = "Дика Тварина",
    [3623635121] = "Аберація",
    [496532506] = "Труп",
}

ns._db.UnitRanks = {
    [133474279] = "Елітний",
    [3982664215] = "Рідкісний",
    [2482834624] = "Рідкісний Елітний",
    [595924386] = "Бос",
}

ns._db.CommonSpellCharacteristics = {
    -- Spell range
    [4074264436] = "Melee Range",
    [3782563343] = "{1} yd range",
    [1817768102] = "{1}-{2} yd range",
    -- Spell cooldown
    [132771445] = "{1} sec cooldown",
    [3950124302] = "{1} min cooldown",
    [1926006671] = "{1} hour cooldown",
    -- Spell cast time
    [2205574258] = "Instant",
    [4176069676] = "{1} sec cast",
    -- Spell Resource
    [123472231] = "{1} Arcane Charges",
    [2883780072] = "{1} Astral Power",
    [1422759959] = "{1} Chi",
    [3803870055] = "{1} to {5} Combo Points",
    [1393788758] = "{1} Energy",
    [1797199989] = "{1} Essence",
    [4012109640] = "{1} Focus",
    [4124423596] = "{1} Fury",
    [32922540] = "{1} Holy Power",
    [1598205381] = "{1} Insanity",
    [3610556042] = "{1} Maelstrom",
    [3537488612] = "{1} Mana",
    [2381226351] = "{1} Pain",
    [1484843775] = "{1} Rage",
    [2901593347] = "{1} Runes",
    [335373991] = "{1} Runic Power",
    [1419705412] = "{1} Soul Shards",
}
