local _, ns = ...;

-- Constants
ns.FACTION_ALLIANCE = "Альянс"
ns.FACTION_HORDE = "Орда"

ns.LEVEL_TRANSLATION = "Рівень"
ns.PAGE_TRANSLATION = "Сторінка"
ns.LEADER_TRANSLATION = "Ватажок"

ns.SPELL_GENERAL_TRANSLATION = "Загальні"
ns.SPELL_PASSIVE_TRANSLATION = "Пасивний"
ns.SPELL_RANK_TRANSLATION = "Pівень"
ns.SPELL_NEXT_RANK_TRANSLATION = "Наступний рівень:"

ns.TALENT_REPLACES_TRANSLATION = "Замінює"
ns.TALENT_REPLACED_BY_TRANSLATION = "Замінено на"
ns.TALENT_UPGRADE_TRANSLATION = "Оновлення"

ns.PET_LEVEL_TRANSLATION = "Супутник {1} рівня"
ns.PET_CAPTURABLE_TRANSLATION = "Mожна приручити"
ns.PET_COLLECTED_TRANSLATION = "Зібрано ({1}/{2})"

ns.IS_TRIVIAL_QUEST_POSTFIX_TRANSLATION = " (низький рівень)"
ns.ABANDON_QUEST_CONFIRM_UA = "Відмовитися від \"%s\"?"
ns.YES_UA = "Так"
ns.NO_UA = "Ні"

ns._db = {}

ns._db.Changelogs = {
    -- version, date, color, type-text, author, title, description
    {
        "1.9.3",
        "18 лютого 2024",
        "blue",
        "Покращення",
        "Cancri",
        nil,
        "Додано підтримку доповнення Immersion. Тепер гравці які його використовують зможуть вмикати переклад завдань."
    },
    {
        "1.9.2",
        "11 грудня 2023",
        "red",
        "Виправлення",
        "Cancri",
        nil,
        "Виправлено помилку, через яку додаток міг не підставляти наявні машинні переклади для завдань."
    },
    {
        "1.9.1",
        "10 грудня 2023",
        "blue",
        "Виправлення та Покращення",
        "Cancri",
        nil,
        "Виправлена проблема з неправильною заміною тега $p на ім'я гравця в описі завдань.\n\nЗа допомогою ШІ було оновлено та перекладено додатково 100 завдань на Драконячих островах. Тепер перекладено приблизно 95% всіх завдань на драконячих островах."
    },
    {
        "1.9.0",
        "10 грудня 2023",
        "purple",
        "Новий функціонал",
        "Cancri",
        nil,
        "Ми додали changelogs для нашого додатка! Тепер ви можете дізнатися про всі новинки і поліпшення, натиснувши кнопку \"Що нового?\" у налаштуваннях. Також, при першому запуску після оновлення, вам автоматично покажуться зміни в новій версії."
    },
    {
        "1.8.19",
        "06 грудня 2023",
        "blue",
        "Машинний переклад",
        "Cancri",
        nil,
        "За допомогою ШІ було перекладенно більше 1000 завдань на Драконячих островах."
    },
    {
        "1.8.18",
        "01 грудня 2023",
        "blue",
        "Машинний переклад",
        "Cancri",
        nil,
        "За допомогою ШІ було перекладенно 969 завдань в наступних локаціях:  Dun Morogh, Elwynn Forest, Dragon Isles, Ohnahran Plains, Thaldraszus, The Azure Span та Valdrakken."
    },
    {
        "1.8.17",
        "25 листопада 2023",
        "purple",
        "Новий функціонал",
        "Cancri",
        "Переклади завдань від ШІ",
        [[Додано нову функцію! Тепер якщо для завдання немає перекладу від людини, буде використовуватися машинний переклад згенерований за допомогою ШІ (штучного інтелекту).

Щоб позначити, що читаєте саме машинний переклад, у верхньому правому кутку вікна з завданням з'явиться піктограма з головою робота.

Крім того, в налаштуваннях тепер можна повністю вимкнути функцію машинних перекладів, якщо вони для вас не потрібні. За замовчуванням машинні переклади увімкнені.]]
    },
    { "1.8.16", "25 листопада 2023", "blue", "Покращення", "Cancri", nil, [[Додано іконку додатка до мінікарти.

Завдяки їй ви швидко можете дізнатися поточну версію додатка, відкрити налаштування (ЛКМ) та перезавантажити ігровий інтерфейс (Shift+ЛКМ).]] },
    { "1.8.15", "25 листопада 2023", "red", "Виправлення", "Cancri", nil, "Виправлено помилку, коли при наявності перекладу текст завершення завдання був порожній у журналі цілей та підказці." },
    { "1.8.14", "25 листопада 2023", "red", "Виправлення", "Cancri", nil, "Виправлено помилку, коли при наявності перекладу вікно привітання для завдання було не перекладене." },
    { "1.8.13", "22 листопада 2023", "red", "Виправлення", "Cancri", nil, "Виправлено помилку, коли випадаюче меню для рецептів професії, які ви відстежуєте, було порожнім." },
    { "1.8.12", "20 листопада 2023", "red", "Виправлення", "Cancri", nil, "Виправлено помилку, коли підказки заклять у книзі заклять не перекладались якщо був встановленний ElvUI." },
    { "1.8.10", "8 листопада 2023", "green", "Різне", "Cancri", nil, "Оновлено файл TOC додатку до версії 10.2.0 та списком причетних." },
    { "1.8.7", "6 листопада 2023", "red", "Виправлення", "Cancri", nil, "Виправлена помилка з неправильними шрифтами, коли вибрана опція \"використовувати шрифт за замовчуванням\"." },
    { "1.8.6", "6 листопада 2023", "red", "Виправлення", "Cancri", nil, "Виправлено тег відмінювання для назви класу." },
    { "1.8.5", "5 листопада 2023", "blue", "Покращення", "Cancri", nil, "Додано переклад для випадаючого меню журналу завдань та трекера цілей." },
    { "1.8.4", "5 листопада 2023", "blue", "Покращення", "Cancri", nil, "Додано переклад підказок для кнопок на карті світу та точок інтересу на карті світу і міні-карті." },
    { "1.8.3", "4 листопада 2023", "blue", "Покращення", "Cancri", nil, "Додано переклади для повідомлень про прогрес завдань (жовтий текст який з'являється зверху екрана, наприклад при вбивстві НІП)." },
    { "1.8.2", "4 листопада 2023", "red", "Виправлення", "Cancri", nil, "Інформаційна підказка (tooltip) НІП тепер містить перекладену інформацію про завдання та цілі до яких він відноситься, а також коректно перекладає тип НІП." },
    { "1.8.1", "4 листопада 2023", "red", "Виправлення", "Cancri", nil, "Кнопка \"змінити переклад\" приховується якщо у завдання немає перекладу." },
    { "1.8.0", "1 листопада 2023", "purple", "Новий функціонал", "Cancri", "Переклади завдань",
        [[Відтепер додаток вміє відображати переклади для завдань. Окрім цього переклади будуть відображатися також для цілей та завдань які ви відстежуєте.

Відкривши вікно з текстом завдання ви побачите нову кнопку для перемикання між оригінальним текстом і перекладом. А також окрему кнопку натиснувши на яку ви зможете скопіювати посилання на wowhead.com для цього завдання.

Якщо вам не цікаві переклади завдань, то ви можете вимкнути їх в налаштуваннях.]] },
    { "1.7.0", "11 жовтня 2023", "purple", "Новий функціонал", "Cancri", nil,
        [[Відтепер в грі перекладене головне меню та підказки в кнопках швидкого доступу (персонаж, здібності й таланти тощо).]] },
    { "1.6.7", "11 жовтня 2023", "blue", "Покращення", "Cancri", nil, "Для перекладачів став доступним тег {sex|%s|%s}. Це дає можливість автоматично обирати правильний переклад в залежності від того, яка стать в НІП, наприклад продавець / продавчиня." },
    { "1.6.6", "2 жовтня 2023", "red", "Виправлення", "Cancri", nil, "Виправлено некоректну заміну числових значень з незакритого кольорового тега в описі заклинання." },
    { "1.6.5", "14 серпня 2023", "red", "Виправлення", "Cancri", nil, "Виправлена некоректна заміна тега для відмінювання слів коли він знаходився всередині інших тегів." },
    { "1.6.4", "6 серпня 2023", "red", "Виправлення", "Cancri", nil, "Додано перевірку, що не потрібно перекладати ім'я НІП, якщо воно приховане, щоб уникнути помилки під час гри." },
    { "1.6.3", "27 липня 2023", "red", "Виправлення", "Cancri", nil, "Видалено зайву двокрапку, коли в відеоролику немає імені оповідача." },
    { "1.6.0", "26 липня 2023", "purple", "Новий функціонал", "Cancri", nil,
        [[Відтепер додаток вміє перекладати субтитри в кат-сценах та "балакучих головах".]] },
    { "1.5.0", "23 липня 2023", "purple", "Новий функціонал", "Cancri", nil,
        [[Відтепер додаток вміє перекладати повідомлення від НІП які ви бачите в чаті, або в "бульбашках" над головою.

Увага! Blizzard забороняють змінювати текст в бульбашках в середині групового контенту (рейди, підземелля тощо.) тому в них український текст буде лише в чаті!]] },
    { "1.4.1", "22 липня 2023", "green", "Рефакторинг", "melles1991", nil, "Покращено код для зручнішого керування модулями перекладів та шрифтами." },
    { "1.4.0", "20 липня 2023", "green", "Різне", "Cancri", nil, "Покращено автоматичну збірку та розгортання додатка на CurseForge. Вдосконалено процес випуску нових версій додатка." },
    { "1.3.1", "20 липня 2023", "purple", "Новий функціонал", "Cancri", nil,
        [[Додано нову функцію! Тепер є можливість перекладати субтитри відеороликів. Спочатку будуть додаватися субтитри для відеороликів поточного доповнення, а потім всіх інших.

Також було додано сторінку зі списком причетних (перекладачі, редактори, стрімери тощо) до налаштувань.]] },
    { "1.3.0", "20 липня 2023", "green", "Різне", "Cancri", nil, "Оновлено файл TOC додатку до версії 10.1.5." },
}
